{
	"filters":[
		{
			"title":"All",
			"val":""
		},{
			"title":"React",
			"val":"react"
		},{
			"title":"Angular",
			"val":"angular"
		},{
			"title":"JQuery",
			"val":"jquery"
		},{
			"title":"PHP",
			"val":"php"
		},{
			"title":"Web",
			"val":"web"
		},{
			"title":"Tablet",
			"val":"tablet"
		},{
			"title":"Mobile",
			"val":"mobile"
		},{
			"title":"Game",
			"val":"game"
		},{
			"title":"Social",
			"val":"social"
		}
	],
	"projects":[
		{
			"title": "For Your Consideration",
			"safename": "starzfyc",
			"background": "img/projects/starz/fyc_background.jpg",
			"projectimage": "img/projects/starz/fyc_projectimage.png",
			"titleart": "img/projects/starz/starz_titleart.png",
			"description": "A microsite used to promote the different Starz original programming that are up for awards.",
			"filters": ["react","jquery","web","tablet","mobile"],
			"marquee": "y",
			"video": "videos/power.mp4",
			"features": [
				"Development // React & Reflux / JQuery / HTML / CSS / XML",
				"Responsive // PC, Tablet & Mobile"
			],
			"link": "http://fyc.brettgrisinger.com/",
			"copy":[
				{
					"title": "PROVIDING A QUICK AND INFORMATIVE LOOK AT ALL THE SERIES",
					"copy": "The Starz For Your Consideration site is a microsite used to promote and allow members of different award guilds to become informed and watch episodes of the all the different Starz original series. The most important features are quick access to the different shows and then each of their episodes.",
					"image": "img/projects/starz/fyc_1.png"
				},{
					"title": "A FLEXIBLE INTERFACE TO CHANGE FOR EACH AWARD GUILD",
					"copy": "Their are many award guilds and they all run at different times of the year so the Starz For Your Consideration site needs to be flexible and easy to update. The site is built upon ReactJS and Reflux to load data JSON files that tells which series are up for each guild as well as the corresponding categories. React allows the site to be quick and flexible using Javascript components to load the data, render them and also handle the video playing.",
					"image": "img/projects/starz/fyc_2.png"
				}
			]
		},{
			"title": "Family Tree",
			"safename": "wqfamilytree",
			"background": "img/projects/whitequeen/familytree_background.jpg",
			"projectimage": "img/projects/whitequeen/familytree_projectimage.png",
			"titleart": "img/projects/whitequeen/whitequeen_ta.png",
			"description": "An interactive family tree for the television mini-series \"The White Queen\" that updates with each episode and includes a fan voting module.",
			"filters": ["php","jquery","web","tablet"],
			"marquee": "y",
			"video": "videos/whitequeen.mp4",
			"features": [
				"Development // JQuery / PHP / HTML / CSS / XML",
				"Responsive // PC, Tablet"
			],
			"link": "http://brettgrisinger.com/projects/whitequeen/index.html",
			"copy":[
				{
					"title": "BUILT FOR A ROYAL FAMILY",
					"copy": "The television mini-series \"The White Queen\" focuses on the battle for the English Throne by three different relentless women, starting in the 1400’s. To help fans keep track of the characters in their quests for power, an interactive family tree was developed for the royal family of England during the time period that the show spanned.",
					"image": "img/projects/whitequeen/familytree_devices.png"
				},{
					"title": "UPDATING WITH EACH EPISODE’S EVENTS",
					"copy": "The goal of The White Queen Family Tree is to help users keep track of the different characters throughout the 10 episode mini-series. In order to accomplish this, the experience is built on a large grid interface and a XML data file that the site parses and then interprets to setup how it’s laid out. As the episode slider changes, it sorts through the data changes and then uses the grid layout to move, update, and make connections to the 90 different characters, as a visualization of the events in each episode. ",
					"image": "img/projects/whitequeen/familytree_grid.png"
				},{
					"title": "MAKING THE USER EXPERIENCE AS SEAMLESS AS POSSIBLE",
					"copy": "Since the family tree houses large amounts of information for the user, it is built as an experience that does not require a fan to learn how to use it. The user experience is built very similar to a mapping interface with zoom, panning, and clicking on points. On computers, this is accomplished with mouse interactions, click and drag to pan, mouse wheel to zoom, and click on points to open character panels. On tablets, this is accomplished with touch dragging to pan, pinch/expand to zoom, and touch to open character panels. All of this, creates an interface without a steep learning curve, in order to easily explore and learn more about the series.",
					"image": "img/projects/whitequeen/familytree_top.png"
				},{
					"title": "THE MOST SCHEMING SCHEMER",
					"copy": "As an added bonus to encourage users to return each week, the family tree also includes a voting module. Based on the current week’s episode, there are three awards to be given out to who the fans deem as most deserving that week. The awards include \"Power Player\", \"Scheming Schemer\", \"War of the Words\", \"Shock and Awe\", \"Scene Stealer\" and \"If Looks Could Kill.\" ",
					"image": "img/projects/whitequeen/familytree_vote.png"
				}
			]
		},{
			"title": "Press Kit",
			"safename": "avedpresskit",
			"background": "img/projects/aved/presskit_background.jpg",
			"projectimage": "img/projects/aved/presskit_projectimage.png",
			"titleart": "img/projects/aved/aved_titleart.png",
			"description": "A promotional microsite for \"Ash Vs Evil Dead\" that uses 3D HTML5 animations to mimick the printed flipbook.",
			"filters": ["jquery","web","tablet","mobile"],
			"marquee": "y",
			"video": "videos/aved.mp4",
			"features": [
				"Development // Jquery / GSAP / HTML / SASS / XML",
				"Responsive // PC, Tablet & Mobile"
			],
			"link": "http://brettgrisinger.com/projects/avedpresskit",
			"copy":[
				{
					"title": "ANIMATING A FLIPBOOK",
					"copy": "The printed press kit for the television show \"Ash Vs Evil Dead\" is a flipbook that brought some of the humor from the show to life. In the digital version, GSAP tween library was used to animate the CSS3 3D properties to make things appear to be fliping or popping up. One of the trickiest parts was flipping the pages of the \"necronomicon,\" or the \"Book of the Dead.\" ",
					"image": "img/projects/aved/presskit_1.png"
				},{
					"title": "SCALING THE ANIMATIONS",
					"copy": "Since this microsite needs to be accessed on multiple devices, it was important for me to build these animations in a way that they could scale without altering its performance. In order to this do, I needed to convert everything to percentages and then scale the container holding all the elements. Using SASS mixins, I was able to convert each element quickly from its coordinates in the inital design document.",
					"image": "img/projects/aved/presskit_2.png"
				}
			]
		},{
			"title": "Press Kit",
			"safename": "bts1presskit",
			"background": "img/projects/blunttalk/bts1presskit_background.jpg",
			"projectimage": "img/projects/blunttalk/bts1presskit_projectimage.png",
			"titleart": "img/projects/blunttalk/blunttalk_titleart.png",
			"description": "A promotional microsite sent to the press for the television show \"Blunt Talk\", featuring an animated intro, cast and production bios, photography galleries, videos and downloads.",
			"filters": ["jquery","web","tablet","mobile"],
			"marquee": "y",
			"video": "videos/blunttalk.mp4",
			"features": [
				"Development // JQuery, GSAP, HTML & CSS",
				"Responsive // PC, Tablet, Mobile"
			],
			"link": "http://brettgrisinger.com/projects/btpk/index.html",
			"copy":[
				{
					"title": "INSIDE LOOK AT BLUNT",
					"copy": "The “Blunt Talk” digital press kit is a microsite used to promote the new comedy show \"Blunt Talk\" to the press. The press kit provides an animated open, cast bios, production bios, photography galleries, videos and downloads to give an inside look at the new show and characters.",
					"image": "img/projects/blunttalk/btpk_1.png"
				},{
					"title": "ANIMATED OPEN",
					"copy": "A key element to the printed version of the \"Blunt Talk\" printed press kit is the vector outline of Walter Blunt's head, which is filled in with different icons representing his personality. To emphasize this section in the digital press kit, it is animated using a plugin to draw the outline and then tween the icons in. The biggest challenge was positioning all of the elements with percentages so that the head and icons were responsive and could scale with different devices.",
					"image": "img/projects/blunttalk/btpk_2.png"
				},{
					"title": "MULTIPLE DEVICES",
					"copy": "It was important to build the site so that it could work on any device. All of the pages required multiple layouts to be sure that the information was quickly viewable at first glance with minimum scrolling.",
					"image": "img/projects/blunttalk/btpk_3.png"
				}
			]
		},{
			"title": "Apothecary Cabinent",
			"safename": "ols1apothecary",
			"background": "img/projects/outlander/apothecary_background.jpg",
			"projectimage": "img/projects/outlander/apothecary_projectimage.png",
			"titleart": "img/projects/outlander/outlander_titleart.png",
			"description": "An informative experience for fans of the television series \"Outlander,\" highlighting the unique attributes of each herb that Claire studies and/or uses to treat illnesses.",
			"filters": ["jquery","web","tablet","mobile"],
			"marquee": "y",
			"video": "videos/outlander.mp4",
			"features": [
				"Development // JQuery, HTML & CSS",
				"Responsive // PC, Tablet, Mobile"
			],
			"link": "http://www.brettgrisinger.com/projects/olsac/index.html",
			"copy":[
				{
					"title": "A LOOK INTO THE PAST",
					"copy": "The Outlander Apothecary Cabinet is an informative experience for fans of the television series \"Outlander,\" allowing users a glimpse into Claire's world in the 1700s as an apothecary. The cabinet provides a look into the 14 herbs and tinctures used by Claire to treat illnesses and also get details on how they were used.",
					"image": "img/projects/outlander/apothecary_devices.png"
				},{
					"title": "PLACING THE HERBS IN THE CABINET",
					"copy": "This was developed in collaboration with set photographers to make the interface a replica of the actual cabinet from the set of \"Outlander,\" From this shot, a few bottles were pulled out, and with a scale tween, it was possible to visualize them coming out of the cabinet on rollover.",
					"image": "img/projects/outlander/apothecary_rollover.png"
				},{
					"title": "HOW THE HERBS WHERE USED IN THE 1700s",
					"copy": "Each herb can be selected, by clicking on the image, providing the user with a drawing of the herb and a detailed description of how Claire used the herb to treat illness in the 1700's, as well as other ways each herb was used for health benefits. ",
					"image": "img/projects/outlander/apothecary_details.png"
				}
			]
		},{
			"title": "I Like It Scot",
			"safename": "ols1ilikeitscot",
			"background": "img/projects/outlander/likeitscot_background.jpg",
			"projectimage": "img/projects/outlander/likeitscot_projectimage.png",
			"titleart": "img/projects/outlander/outlander_titleart.png",
			"description": "An activity for fans of the Scotland-based television series \"Outlander\" to create a sharable social image to tell their friends that they \"Like It Scot\" and are ready for the new season to begin.",
			"filters": ["php","jquery","web","tablet","mobile","social"],
			"marquee": "",
			"video": "",
			"features": [
				"Development // PHP, JQuery, HTML & CSS",
				"Responsive // PC, Tablet, Mobile"
			],
			"link": "http://brettgrisinger.com/projects/outlanderphoto/index.php",
			"copy":[
				{
					"title": "SHOW THE WORLD",
					"copy": "\"Outlander\" is a show that is based in the 1700s in Scotland, and has a very passionate fan based. The Outlander \"I Like It Scot\" is an activity for the fans to create a social image that can be shared with their friends, and to tell everybody that they are fan of the show and are ready for the new season of the show to begin. ",
					"image": "img/projects/outlander/op_1.png"
				},{
					"title": "WALKING USERS THROUGH THE PROCESS",
					"copy": "With this activity, it is very important to walk users through the process and make it as easy as possible. In order to do this, the experience was created in steps, and as user-friendly as possible with visual guides explaining more about the difficult functionality of positioning and resizing.",
					"image": "img/projects/outlander/op_2.png"
				},{
					"title": "USING HTML5",
					"copy": "While this experience could be done easily in both flash and a mobile app, it would require downloads from the user. So it was created using PHP and HTML5, in order to build this experience in a way that would save development time and also provide a uniform experience on any device.",
					"image": "img/projects/outlander/op_3.png"
				}
			]
		},{
			"title": "Ultimate Showdown",
			"safename": "spshowdown",
			"background": "img/projects/spartacus/ultimateshowdown_background.jpg",
			"projectimage": "img/projects/spartacus/ultimateshowdown_projectimage.png",
			"titleart": "img/projects/spartacus/spartacus_titleart.png",
			"description": "A facebook gladiator tournament where participants help their favorite gladiators from the television series \"Spartacus\" in their battle to become the champion.",
			"filters": ["php","web","social"],
			"marquee": "y",
			"video": "videos/spartacus.mp4",
			"features": [
				"Development // PHP, HTML & CSS",
				"Platform // Facebook App"
			],
			"link": "",
			"copy":[
				{
					"title": "A TOURNAMENT WORTHY OF GLADIATORS",
					"copy": "In the break between the second and the final season of \"Spartacus\", there was a desire to engage the large Facebook fan base and draw hype to the release of the second season on DVD. Therefore, a gladiator battle tournament was created where fans of the show could vote for their favorite gladiator in their battle to become the champion.",
					"image": "img/projects/spartacus/spartacus_top1.png"
				},{
					"title": "TWO GLADIATORS FACE OFF IN THE ARENA",
					"copy": "Each day featured a new pair of gladiators to battle against each other, and fans were asked to pick who they wanted or thought would win if the two gladiators fought in the arena. After the fans voted, they were shown the voting percentages to see if their gladiator was winning, and on their way to becoming champion, or if they might be eliminated from the tournament.",
					"image": "img/projects/spartacus/spartacus_battle1.png"
				},{
					"title": "WHO WILL BE CHAMPION?",
					"copy": "The tournament field consisted of the 8 most popular gladiators from the first two seasons, and were seeded in similar fashion to the NCAA basketball tournament. The winner of each first round matchup moved on to another battle and ultimately ended with a champion that was not the legendary Spartacus, but the fan favorite Ganicus.",
					"image": "img/projects/spartacus/spartacus_brackets1.png"
				},{
					"title": "A CHANCE TO WIN",
					"copy": "In addition to the battles, this experience was used to promote the release of the second season of \"Spartacus\" on DVD. Once a fan voted in the daily battle, they earned a chance to win a copy of the second season on DVD or Blu-ray and could come back each day for another shot to win. ",
					"image": "img/projects/spartacus/spartacus_sweeps1.png"
				}
			]
		},{
			"title": "Press Kit",
			"safename": "srs1presskit",
			"background": "img/projects/survivorsremorse/presskit_background.jpg",
			"projectimage": "img/projects/survivorsremorse/presskit_projectimage.png",
			"titleart": "img/projects/survivorsremorse/survivorsremorse_titleart.png",
			"description": "A promotional microsite sent to the press for the television show \"Survivor's Remorse\", featuring cast and production bios, photography galleries, videos and downloads.",
			"filters": ["jquery","web","tablet","mobile"],
			"marquee": "",
			"video": "",
			"features": [
				"Development // JQuery, GSAP, HTML & CSS",
				"Responsive // PC, Tablet, Mobile"
			],
			"link": "http://www.brettgrisinger.com/projects/srpk/index.html",
			"copy":[
				{
					"title": "PROMOTING THE SHOW",
					"copy": "To spread the word about the upcoming show, \"Survivor's Remorse,\" a digital press kit microsite was built off of the printed press kit that goes out to the press. This press kit is designed to provide a visual of the show's flavor and also provide cast bios, production bios, photography galleries, videos and downloads.",
					"image": "img/projects/survivorsremorse/sr_devices.png"
				},{
					"title": "TYPOGRAPHY",
					"copy": "The main feature in the \"Survivor's Remorse\" press kit is both the attitude and style that is developed through the white space, character shots, and accents of strong and bold typography. To emphasize these key features, animation is used when you page through on the home page with the arrow keys, using the motion to draw attention to the amazing typography and photography.",
					"image": "img/projects/survivorsremorse/sr_type.png"
				},{
					"title": "TABLET AND MOBILE VERSION",
					"copy": "The press can often be viewing the site on many different devices, so an important element to the press kits is to make sure they can be viewed on any device and allow the user to quickly get to the information they need.",
					"image": "img/projects/survivorsremorse/sr_mobile.png"
				}
			]
		},{
			"title": "Pirate Prize Wheel",
			"safename": "blsprizewheel",
			"background": "img/projects/blacksails/piratewheel_background.jpg",
			"projectimage": "img/projects/blacksails/piratewheel_projectimage.png",
			"titleart": "img/projects/blacksails/blacksails_titleart.png",
			"description": "A portable training activity for the promotion of the television series \"Black Sails,\" which includes a pirate theme and editable prizes.",
			"filters": ["jquery","web","tablet","game"],
			"marquee": "y",
			"video": "videos/blacksails.mp4",
			"features": [
				"Development // JQuery, HTML & CSS",
				"Responsive // PC, Tablet"
			],
			"link": "http://www.brettgrisinger.com/projects/bkspw/index.html",
			"copy":[
				{
					"title": "IN PURSUIT OF PIRATE'S TREASURE",
					"copy": "For the promotion of the new pirate series, \"Black Sails,\" a portable prize wheel was created which could be carried around on tablets by representatives to award prizes for correct answers about the show and pirates.",
					"image": "img/projects/blacksails/prizewheel_ingraphic.png"
				},{
					"title": "MAKING A PIRATE'S WHEEL",
					"copy": "Since this prize wheel was going to be themed for pirates, the wheel was made to look like the steering wheel from the Walrus, the ship used by the pirates in \"Black Sails.\" In order to do this, a prop shot was used that included the wheel, and then with photo retouching the wheel image was treated so that it could become a viable asset.",
					"image": "img/projects/blacksails/piratewheel2.png"
				},{
					"title": "CHANGEABLE PRIZES AND QUESTIONS ON THE FLY",
					"copy": "This was designed and developed around the concept that representatives needed to be able to change out the prizes and questions on the fly, and without requiring logins. The solution was to store the data for the prizes and questions in cookies. This way, the data was device specific and could be shared and edited by any of the representatives, and if they run out of a prize, it could be easily and quickly updated. ",
					"image": "img/projects/blacksails/editpage.png"
				},{
					"title": "LANDING ON THE PRIZES",
					"copy": "In the beginning phases of developing the spinning wheel, it became apparent that a controlled spin would need to be developed so that it would land directly on a prize, and not somewhere in between two prizes. In order to achieve this, a prize was randomly selected before any spinning occurred, and it then calculated out what the degree would be for that prize. From there, it was multiplied by the number of rotations, and then spun directly to that point. This way the prize wheel always landed directly on a prize.",
					"image": "img/projects/blacksails/prod_shot.png"
				}
			]
		}
	]
}
